app/views/dashboard/show.html.erb

        <span class="spacer"></span>
        <span class="mono-dim"><%= Event.count %> events · 24h</span>
---
SELECT COUNT(*) FROM "events"