app/views/board/show.html.erb

    <select name="repo" class="textarea" style="min-height:0;padding:6px;font-size:12px;width:150px">
      <% repos = (Workspace.ticket_targets + Ticket.on_board.distinct.pluck(:repo)).compact.uniq %>
---
SELECT DISTINCT "tickets"."repo" FROM "tickets"