app/views/shared/_wizard.html.erb

            <div class="chip-row">
              <% Setting::ORCHESTRATOR_MODELS.each do |value, label| %>
---
SELECT "settings".* FROM "settings" ORDER BY "settings"."id" ASC LIMIT $1  [["LIMIT", 1]]

            <% unchecked_spec_repos = openspec_names - Workspace.selected_repos(@setting).map { |r| r[:name] } %>
            <% spec_count = Capability.count %>
---
SELECT COUNT(*) FROM "capabilities"

                  <span style="color:<%= spec_count.positive? ? 'var(--ok)' : 'var(--tx3)' %>"><%= spec_count.positive? ? "✓" : "◦" %></span>
                  <span class="t"><%= spec_count.positive? ? "#{spec_count} capabilities · #{SpecRequirement.count} requirements in the spec index" : "spec index is empty — parse below" %></span>
---
SELECT COUNT(*) FROM "spec_requirements"

                 end %>
              <% spec_line = Capability.any? ? "parsed #{Capability.count} openspec capabilities, #{SpecRequirement.count} requirements" : "parsed 11 openspec capabilities, 68 requirements" %>
---
SELECT 1 AS one FROM "capabilities" LIMIT $1  [["LIMIT", 1]]