app/controllers/activity_controller.rb

  def show
    if @setting.live_mode?
      @rooms = [WORKSPACE_ROOM] +
               Ticket.on_board.order(:code).limit(10).pluck(:code)
      @room = @rooms.include?(params[:room]) ? params[:room] : WORKSPACE_ROOM
    else
      @rooms = [DEMO_ROOM]
      @room = DEMO_ROOM
    end

    @messages = ChatMessage.in_room(@room).to_a
    @events = if @room == WORKSPACE_ROOM || @room == DEMO_ROOM
      Event.recent.limit(30).to_a
    else
      Event.where(ticket_code: @room).recent.limit(30).to_a
    end
    # a fresh user message with no reply yet → show the thinking indicator
    @awaiting_reply = @messages.last&.from_user? && @messages.last.sent_at > 3.minutes.ago
---
SELECT "chat_messages".* FROM "chat_messages" WHERE "chat_messages"."room" = $1 ORDER BY "chat_messages"."sent_at" ASC, "chat_messages"."id" ASC  [["room", "ALG-215"]]