app/controllers/board_controller.rb

  def show
    tickets = Ticket.on_board.includes(:agent).order(:code).group_by(&:state)
---
SELECT "tickets".* FROM "tickets" WHERE "tickets"."state" != $1 ORDER BY "tickets"."code" ASC  [["state", 8]]
SELECT COUNT(*) FROM "tickets" WHERE "tickets"."state" IN ($1, $2, $3, $4, $5, $6)  [["state", 2], ["state", 3], ["state", 4], ["state", 5], ["state", 6], ["state", 7]]