app/controllers/chat_messages_controller.rb

INSERT INTO "chat_messages" ("attach_label", "body", "created_at", "room", "sender", "sent_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    body = params[:body].to_s.strip
    if body.present?
      message = ChatMessage.create!(
        room: ActivityController::ROOM, sender: "you", body: body, sent_at: Time.current
      )