app/controllers/dashboard_controller.rb

  def show
    @events = Event.recent.limit(22).to_a
    @board = Ticket.on_board.includes(:agent, :phase_runs, :ticket_gates).to_a
    @gates = Gate.pending.includes(:ticket).order(:created_at).to_a
    @gate = @gates.first
    @questions = Question.pending.order(asked_at: :asc).to_a
    @failed_tickets = @board.select { |t| t.current_phase_run&.status == "failed" }
---
SELECT "phase_runs".* FROM "phase_runs" WHERE "phase_runs"."ticket_id" = $1  [["ticket_id", 6]]
SELECT "gates".* FROM "gates" WHERE "gates"."status" = $1 ORDER BY "gates"."created_at" ASC LIMIT $2  [["status", "pending"], ["LIMIT", 1]]