app/controllers/questions_controller.rb

SELECT "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def answer
    question = Question.find(params[:id])