app/controllers/settings_controller.rb

SELECT "settings".* FROM "settings" ORDER BY "settings"."id" ASC LIMIT $1  [["LIMIT", 1]]
UPDATE "settings" SET "autonomy" = $1, "updated_at" = $2 WHERE "settings"."id" = $3  [["autonomy", "every"], ["updated_at", "2026-08-14 13:01:43.229734"], ["id", 4]]
---
  def autonomy
    value = params[:value].to_s
    @setting.update!(autonomy: value) if Setting::AUTONOMY_MODES.include?(value)

UPDATE "settings" SET "spend_today" = $1, "updated_at" = $2 WHERE "settings"."id" = $3  [["spend_today", "0.0"], ["updated_at", "2026-08-14 13:01:43.307169"], ["id", 5]]
---
  def toggle_run
    if !@setting.running? && @setting.over_cap?
      @setting.override_cap_for_today!
      Event.record!(phase_tag: "SYS", agent_name: "you", text: "Spend cap overridden for today — the forge burns on")
    end
    @setting.update!(running: !@setting.running)