app/controllers/specs_controller.rb

UPDATE "settings" SET "setup" = $1, "updated_at" = $2 WHERE "settings"."id" = $3  [["setup", "{\"spec_sync_progress\":{\"done\":0,\"total\":0,\"label\":\"scanning repositories…\",\"at\":1786741725}}"], ["updated_at", "2026-08-14 21:08:45.865668"], ["id", 259]]
---
  def sync
    progress = @setting.setup["spec_sync_progress"]
    unless progress && progress["at"].to_i > 90.seconds.ago.to_i
      @setting.update!(setup: @setting.setup.merge(
        "spec_sync_progress" => { "done" => 0, "total" => 0, "label" => "scanning repositories…", "at" => Time.current.to_i }
      ))