app/controllers/wizard_controller.rb

  def patch
    key = params[:key].to_s
    value = params[:value].to_s
    if key == "workspace_dir"
      if value.match?(WORKSPACE_DIR_VALUE) && !value.include?("..") && !value.start_with?("/")
        Workspace.refresh!
        @setting.update!(setup: @setting.setup.merge(key => value))
---
UPDATE "settings" SET "setup" = $1, "updated_at" = $2 WHERE "settings"."id" = $3  [["setup", "{\"fw\":\"1\"}"], ["updated_at", "2026-08-14 13:01:43.729333"], ["id", 7]]